Revit 2027 API
CurtainGrid.GetMullionIds Method
 Gets all ElementIds of the mullions of the curtain grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetMullionIds()
Public Function GetMullionIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetMullionIds()
member GetMullionIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
The mullion ElementIds
Remarks
 ElementIds are of Mullion Elements.
See Also
Reference
CurtainGrid Class
Autodesk.Revit.DB Namespace